#include "contact.h"

static void ShowMenu()//打印菜单
{
	printf("                                ******************************************\n");
	printf("                                ******************************************\n");
	printf("                                -----------请选择需要进行的操作-----------\n");
	printf("                                ---------------1.添加联系人---------------\n");
	printf("                                ---------------2.删除联系人---------------\n");
	printf("                                ---------------3.查找联系人---------------\n");
	printf("                                ---------------4.修改联系人---------------\n");
	printf("                                ---------------5.显示联系人---------------\n");
	printf("                                ---------------6.清空联系人---------------\n");
	printf("                                ---------------7.排序联系人---------------\n");
	printf("                                ---------------0.退出通讯录---------------\n");
	printf("                                ******************************************\n");
	printf("                                ******************************************\n");
}
//static void ShowMenu()//打印菜单
//{
//	printf("******************************************\n");
//	printf("******************************************\n");
//	printf("-----------请选择需要进行的操作-----------\n");
//	printf("---------------1.添加联系人---------------\n");
//	printf("---------------2.删除联系人---------------\n");
//	printf("---------------3.查找联系人---------------\n");
//	printf("---------------4.修改联系人---------------\n");
//	printf("---------------5.显示联系人---------------\n");
//	printf("---------------6.清空联系人---------------\n");
//	printf("---------------7.排序联系人---------------\n");
//	printf("---------------0.退出通讯录---------------\n");
//	printf("******************************************\n");
//	printf("******************************************\n");
//}

int main()
{
	contact_t *ct = NULL;//定义结构体指针
	InitContact(&ct);//对通讯录进行初始化
	int select = 0;
	int quit = 0;
	while (!quit){
		ShowMenu();
		scanf("%d", &select);
		switch (select){
		case 1://添加联系人
			AddContacts(&ct);
			break;
		case 2://删除联系人
			DelContacts(ct);
			break;
		case 3://查找联系人
			SearchContacts(ct);
			break;
		case 4://修改联系人
			ModContact(ct);
			break;
		case 5://显示联系人
			ShowContact(ct);
			break;
		case 6://清空联系人
			ClearContacts(ct);
			break;
		case 7://排序联系人
			SortContact(ct);
			break;
		case 0://退出通讯录
			SaveContact(ct);
			quit = 1;
			printf("退出成功!\n");
			break;
		default:
			printf("输入有误，请重新输入!\n");
			system("pause");
			system("cls");
			break;
		}
	}
	free(ct);//将申请的堆空间释放,避免内存泄漏问题

	system("pause");
	return 0;
}